In [4]:
import pandas as pd
import numpy as np

In [5]:
speeds = pd.DataFrame(

    [

        ("bird", "Falconiformes", 389.0),

        ("bird", "Psittaciformes", 24.0),

        ("mammal", "Carnivora", 80.2),

        ("mammal", "Primates", np.nan),

        ("mammal", "Carnivora", 58),

    ],

    index=["falcon", "parrot", "lion", "monkey", "leopard"],

    columns=("class", "order", "max_speed"),

)



speeds

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [6]:
grouped = speeds.groupby("class")

In [8]:
grouped

In [7]:
grouped = speeds.groupby(["class", "order"])

In [9]:
grouped

In [10]:
df = pd.DataFrame(

    {

        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],

        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],

        "C": np.random.randn(8),

        "D": np.random.randn(8),

    }

)



df

     A      B         C         D
0  foo    one -0.508504 -0.300867
1  bar    one -2.902925  0.941785
2  foo    two -0.799524  0.800131
3  bar  three  0.761373 -0.721042
4  foo    two -0.514624  1.171055
5  bar    two  0.038246 -0.037845
6  foo    one -0.378629 -0.405836
7  foo  three -0.575681  1.412087

In [11]:
grouped = df.groupby("A")

grouped = df.groupby("B")

grouped = df.groupby(["A", "B"])

In [14]:
df2 = df.set_index(["A", "B"])

In [15]:
df2.index.names.difference(["B"])

FrozenList(['A'])

In [16]:
grouped = df2.groupby(level=df2.index.names.difference(["B"]))

grouped.sum()

            C         D
A
bar -2.103306  0.182897
foo -2.776962  2.676570

In [17]:
df

     A      B         C         D
0  foo    one -0.508504 -0.300867
1  bar    one -2.902925  0.941785
2  foo    two -0.799524  0.800131
3  bar  three  0.761373 -0.721042
4  foo    two -0.514624  1.171055
5  bar    two  0.038246 -0.037845
6  foo    one -0.378629 -0.405836
7  foo  three -0.575681  1.412087

In [18]:
df.T

,0,1,2,3,4,5,6,7
A,foo,bar,foo,bar,foo,bar,foo,foo
B,one,one,two,three,two,two,one,three
C,-0.508504,-2.902925,-0.799524,0.761373,-0.514624,0.038246,-0.378629,-0.575681
D,-0.300867,0.941785,0.800131,-0.721042,1.171055,-0.037845,-0.405836,1.412087

In [19]:
def get_letter_type(letter):

    if letter.lower() in 'aeiou':

        return 'vowel'

    else:

        return 'consonant'



grouped = df.T.groupby(get_letter_type)

In [22]:
list(grouped)

[('consonant',
            0         1         2         3         4         5         6  \
  B       one       one       two     three       two       two       one
  C -0.508504 -2.902925 -0.799524  0.761373 -0.514624  0.038246 -0.378629
  D -0.300867  0.941785  0.800131 -0.721042  1.171055 -0.037845 -0.405836

            7
  B     three
  C -0.575681
  D  1.412087  ),
 ('vowel',
       0    1    2    3    4    5    6    7
  A  foo  bar  foo  bar  foo  bar  foo  foo)]

In [21]:
dict(list(grouped))

{'consonant':           0         1         2         3         4         5         6  \
 B       one       one       two     three       two       two       one
 C -0.508504 -2.902925 -0.799524  0.761373 -0.514624  0.038246 -0.378629
 D -0.300867  0.941785  0.800131 -0.721042  1.171055 -0.037845 -0.405836

           7
 B     three
 C -0.575681
 D  1.412087  ,
 'vowel':      0    1    2    3    4    5    6    7
 A  foo  bar  foo  bar  foo  bar  foo  foo}

In [23]:
index = [1, 2, 3, 1, 2, 3]

s = pd.Series([1, 2, 3, 10, 20, 30], index=index)

s

1     1
2     2
3     3
1    10
2    20
3    30
dtype: int64

In [24]:
grouped = s.groupby(level=0)

grouped.first()

1    1
2    2
3    3
dtype: int64

In [25]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [26]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [27]:
df2 = pd.DataFrame({"X": ["B", "B", "A", "A"], "Y": [1, 2, 3, 4]})

df2.groupby(["X"]).sum()

   Y
X
A  7
B  3

In [28]:
df2.groupby(["X"], sort=False).sum()

   Y
X
B  3
A  7

In [30]:
df3 = pd.DataFrame({"X": ["A", "B", "A", "B"], "Y": [1, 4, 3, 2]})
df3

   X  Y
0  A  1
1  B  4
2  A  3
3  B  2

In [31]:
df3.groupby("X").get_group("A")

   X  Y
0  A  1
2  A  3

In [32]:
df3.groupby(["X"]).get_group(("B",))

   X  Y
1  B  4
3  B  2

In [37]:
grouped = df3.groupby(["X"])
for group in df3.groupby(["X"]):
    print(grouped.get_group(group[0]))
    print()

   X  Y
0  A  1
2  A  3

   X  Y
1  B  4
3  B  2

In [38]:
df_list = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]

df_dropna = pd.DataFrame(df_list, columns=["a", "b", "c"])

df_dropna

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [39]:
# Default ``dropna`` is set to True, which will exclude NaNs in keys

df_dropna.groupby(by=["b"], dropna=True).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [40]:
df_dropna.groupby(by=["a"], dropna=True).sum()

     b  c
a
1  4.0  9
2  1.0  3

In [41]:
# In order to allow NaN in keys, set ``dropna`` to False

df_dropna.groupby(by=["b"], dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [42]:
df_dropna.groupby(by=["a"], dropna=False).sum()

     b  c
a
1  4.0  9
2  1.0  3

In [46]:
df

     A      B         C         D
0  foo    one -0.508504 -0.300867
1  bar    one -2.902925  0.941785
2  foo    two -0.799524  0.800131
3  bar  three  0.761373 -0.721042
4  foo    two -0.514624  1.171055
5  bar    two  0.038246 -0.037845
6  foo    one -0.378629 -0.405836
7  foo  three -0.575681  1.412087

In [43]:
df.groupby("A").groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [44]:
type(df.groupby("A").groups)

pandas.io.formats.printing.PrettyDict

In [45]:
df.T.groupby(get_letter_type).groups

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

In [47]:
grouped = df.groupby(["A", "B"])

grouped.groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

In [48]:
len(grouped)

6

In [49]:
n = 10

weight = np.random.normal(166, 20, size=n)

height = np.random.normal(60, 10, size=n)

time = pd.date_range("1/1/2000", periods=n)

gender = np.random.choice(["male", "female"], size=n)

df = pd.DataFrame(

    {"height": height, "weight": weight, "gender": gender}, index=time

)



df

               height      weight  gender
2000-01-01  70.061278  151.952109  female
2000-01-02  48.641225  184.315163    male
2000-01-03  78.057669  180.824030    male
2000-01-04  55.084145  183.839620  female
2000-01-05  47.292636  166.699377    male
2000-01-06  55.304786  170.528019  female
2000-01-07  73.073936  200.049017    male
2000-01-08  60.743282  189.559258  female
2000-01-09  65.020631  177.442042  female
2000-01-10  62.595845  196.619704  female

In [50]:
gb = df.groupby("gender")

In [51]:
gb.groups

{'female': [2000-01-01 00:00:00, 2000-01-04 00:00:00, 2000-01-06 00:00:00, 2000-01-08 00:00:00, 2000-01-09 00:00:00, 2000-01-10 00:00:00], 'male': [2000-01-02 00:00:00, 2000-01-03 00:00:00, 2000-01-05 00:00:00, 2000-01-07 00:00:00]}